InformationRegisters/КодыМаркировкиДляПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыМаркировкиДляПечати</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПечати</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CDNПлощадки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CDNПлощадки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНедоступностиДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПроверкиКодаМаркировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыВыпускаВОборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыВыпускаВОборот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортВРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркировкаОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрансграничнаяТорговля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемаркировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыЗаполненияСерийногоНомера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыЗаполненияСерийногоНомера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДокументовСоответствия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДокументовСоответствия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СертификатСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекларацияОСоответствии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныПеремаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПричиныПеремаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИспорченаМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаВОписании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратБезМаркировкиРозничнаяПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратБезМаркировкиДистанционнаяПродажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПервичныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КассовыйЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварныйЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможеннаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктУничтожения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныВыводаИзОборота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПричиныВыводаИзОборота</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РозничнаяПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДистанционнаяПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтратаПовреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уничтожение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конфискация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ликвидация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСобственныхНужд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныСписанияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПричиныСписанияКодовМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утерян</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уничтожен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыВозвратов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыВозвратов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПриРозничнойРеализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПриДистанционномСпособе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекВозврата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УправлениеКодамиМаркировкиКлиентСервер1/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Очищает представления с кодами маркировки с криптохвостами после печати
//
Процедура ОчисткаНапечатанныхКодовМаркировки(СтруктураПараметров) Экспорт
	
	Если НЕ СтруктураПараметров.Свойство("СрокХраненияКодаМаркировки") Тогда
		Возврат;
	КонецЕсли;
	
	// Не указан срок хранения кодов
	СрокХранения = СтруктураПараметров.СрокХраненияКодаМаркировки;
	Если СрокХранения = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КодыМаркировкиДляПечати.ДокументОснование КАК ДокументОснование,
	               |	КодыМаркировкиДляПечати.Номенклатура КАК Номенклатура,
	               |	КодыМаркировкиДляПечати.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	КодыМаркировкиДляПечати.КодМаркировки КАК КодМаркировки
	               |ИЗ
	               |	РегистрСведений.КодыМаркировкиДляПечати КАК КодыМаркировкиДляПечати
	               |ГДЕ
	               |	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(КодыМаркировкиДляПечати.ДатаПечати, ДЕНЬ), &ТекущаяДата, ДЕНЬ) >= &СрокХранения
	               |	И КодыМаркировкиДляПечати.ДатаПечати <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СрокХранения", СрокХранения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Чистим код маркировки для всех найденных записей
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.КодыМаркировкиДляПечати.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
		Набор.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		Набор.Отбор.ХарактеристикаНоменклатуры.Установить(Выборка.ХарактеристикаНоменклатуры);
		Набор.Отбор.КодМаркировки.Установить(Выборка.КодМаркировки);
		
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроЦедуры // ОчисткаНапечатанныхКодовМаркировки()

// Создает документы с разбивкой по 10 строк заказ на маркировку
//
Процедура СформироватьЗаказыНаКодыМаркировки(Основание) Экспорт
	
	Если ТипЗнч(Основание) <> Тип("ДокументОбъект.ЗаказКодовМаркировки") Тогда
		ДокументОбъект = Документы.ЗаказКодовМаркировки.СоздатьДокумент();
		ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьОграничениеСтрок");
		ДокументОбъект.Заполнить(Основание);
		ОснованиеДокумента = Основание;
	Иначе
		ДокументОбъект = Основание;
		ОснованиеДокумента = ДокументОбъект.ДокументОснование;
	КонецЕсли;
	
	// Разберем полученный документ на несколько по 10 строк
	КоличествоСтрок = ДокументОбъект.Товары.Количество();
	
	СписокДокументов = Новый Массив;
	
	НачатьТранзакцию();
	
	Пока КоличествоСтрок > 0 Цикл
		
		НовыйДокумент = Документы.ЗаказКодовМаркировки.СоздатьДокумент();
		НовыйДокумент.ДополнительныеСвойства.Вставить("НеПроверятьОграничениеСтрок");
		НовыйДокумент.Заполнить(ОснованиеДокумента);
		НовыйДокумент.УстановитьНовыйНомер();
		НовыйДокумент.Товары.Очистить();
		
		КоличествоНоменклатуры = Мин(ДокументОбъект.Товары.Количество(), 10);
		
		МассивУдалить = Новый Массив;
		
		Для Инд = 0 По (КоличествоНоменклатуры - 1) Цикл
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДокументОбъект.Товары[Инд]);
			
			МассивУдалить.Добавить(ДокументОбъект.Товары[Инд]);
			
		КонецЦикла;
		
		Попытка
			НовыйДокумент.ОбменДанными.Загрузка = Истина;
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			СписокДокументов.Добавить(НовыйДокумент.Ссылка);
		Исключение
			ОтменитьТранзакцию();
			#Если Клиент Тогда
				Сообщить("При формировании заказа на маркировку обнаружена ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			#КонецЕсли
			Прервать;
		КонецПопытки;
		
		КоличествоСтрок = КоличествоСтрок - КоличествоНоменклатуры;
		
		// Удалим заполненные строки
		Для Каждого ТекущаяСтрока Из МассивУдалить Цикл
			ДокументОбъект.Товары.Удалить(ТекущаяСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
	Попытка
		ЗафиксироватьТранзакцию();
		#Если Клиент Тогда
			Сообщить("Созданы по данному документы заказы на эмиссию кодов маркировки. Необходимо завершить заполнение документов и отправить запрос в Честный знак.", СтатусСообщения.Важное);
			Для Каждого ТекущийДокумент Из СписокДокументов Цикл
				Сообщить(Строка(ТекущийДокумент.Ссылка));
			КонецЦикла;
		#КонецЕсли
	Исключение
		ОтменитьТранзакцию();
		#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
			Сообщить("Формирование заказов кодов маркировки отменено", СтатусСообщения.Внимание);
		#КонецЕсли
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

// Делает запись в регистр "Коды маркировки для печати" кодов маркировки с криптохвостами.
//
// Параметры:
//  Ссылка - ДокументСсылка.ЗаказКодовМаркировки - документ заказа кодов маркировки;
//  КодыМаркировки - ТаблицаЗначений - таблица, содержащая информацию о кодах маркировки:
//    * Номенклатура - СправочникСсылка.Номенклатура - номенклатура;
//    * ХарактеристикаНоменклатуры - СправочникСсылка.ХарактеристикаНоменклатуры - характеристика номенклатуры;
//    * КодМаркировки - Строка - полученный полный код маркировки.
//  ОписаниеОшибки - Строка - ошибки, возникшие при записи в регистр
//
Процедура ДобавитьЗаписиВРегистр(Ссылка, КодыМаркировки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.КодыМаркировкиДляПечати.ДобавитьЗаписиВРегистр(Ссылка, КодыМаркировки);
	
КонецПроцедуры

Функция ВидПродуции(Документ) Экспорт
	
	Попытка
		ВидПродукции = Документ.ТоварнаяГруппа.ТоварнаяГруппа;
	Исключение
		ВидПродукции = "";
	КонецПопытки;
	
	Возврат ВидПродукции;
	
КонецФункции

Функция ИдентификаторШаблонаЭтикетки(Документ) Экспорт
	
	Попытка
		Идентификатор = Документ.ТоварнаяГруппа.КодТоварнойГруппы;
	Исключение
		Идентификатор = "";
	КонецПопытки;
	Возврат Идентификатор;
	
КонецФункции

Функция СпособВыпускаВОборот(СпособВыпуска) Экспорт
	
	Если СпособВыпуска = Перечисления.СпособыВыпускаВОборот.ПроизводствоРФ Тогда
		Возврат "PRODUCTION";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.МаркировкаОстатков Тогда
		Возврат "REMAINS";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.ТрансграничнаяТорговля Тогда
		Возврат "CROSSBORDER";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.ИмпортВРФ Тогда
		Возврат "IMPORT";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.Перемаркировка Тогда
		Возврат "REMARK";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определен способ выпуска в оборот!");
	#КонецЕсли
	
	Возврат Неопределено;
	
КонецФункции

Функция СпособЗаполненияСерийныхНомеров(ЗначениеСпособаЗаполнения) Экспорт 
	
	Если ЗначениеСпособаЗаполнения = Перечисления.СпособыЗаполненияСерийногоНомера.Автоматически Тогда
		Возврат "OPERATOR"
	ИначеЕсли ЗначениеСпособаЗаполнения = Перечисления.СпособыЗаполненияСерийногоНомера.Ручной Тогда
		Возврат "SELF_MADE";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определен способ заполнения серийных номеров!");
	#КонецЕсли
	
	Возврат Неопределено;
	
КонецФункции 

Функция ПолучитьТаблицуУпращенногоВводаМаркировок(Документ) Экспорт
	
	// Пока только для моделей
	ТаблицаТоваров = Новый Массив;
	
	МассивМоделей = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Документ.Товары Цикл
		
		model = СокрЛП(ТекущаяСтрока.Модель);
		
		Если НЕ ПустаяСтрока(ТекущаяСтрока.GTIN)
			ИЛИ ПустаяСтрока(model)
			ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.КодТНВЭД)
			ИЛИ МассивМоделей.Найти(model) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КодТНВЭД = Лев(ТекущаяСтрока.КодТНВЭД.Код, 2);
		
		НоваяСтрока = Новый Структура();
		НоваяСтрока.Вставить("Код", КодТНВЭД);
		НоваяСтрока.Вставить("model", model);
		ТаблицаТоваров.Добавить(НоваяСтрока);
		
		МассивМоделей.Добавить(model);
		
	КонецЦикла;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ВидДокументаСоответствия(ВидДокумента) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыДокументовСоответствия.ДекларацияОСоответствии Тогда
		Возврат "CONFORMITY_DECLARATION";
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументовСоответствия.СертификатСоответствия Тогда
		Возврат "CONFORMITY_CERTIFICATE";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПричинаПеремаркировки(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныПеремаркировки.ИспорченаМаркировка Тогда
		Возврат "KM_SPOILED";
	ИначеЕсли Причина = Перечисления.ПричиныПеремаркировки.ОшибкаВОписании Тогда
		Возврат "DESCRIPTION_ERRORS";
	ИначеЕсли Причина = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиДистанционнаяПродажа Тогда
		Возврат "REMOTE_SALE_RETURN";
	ИначеЕсли Причина = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиРозничнаяПродажа Тогда
		Возврат "RETAIL_RETURN";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПричинаПеремаркировки()

Функция ВидПервичногоДокумента(ВидДокумента) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыПервичныхДокументов.КассовыйЧек Тогда
		Возврат "RECEIPT";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТоварныйЧек Тогда
		Возврат "SALES_RECEIPT";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТаможеннаяДекларация Тогда
		Возврат "CUSTOMS_DECLARATION";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.УПД Тогда
		Возврат "UTD";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТоварнаяНакладная Тогда
		Возврат "CONSIGNMENT_NOTE";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.АктУничтожения Тогда
		Возврат "DESTRUCTION_ACT";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.Прочее Тогда
		Возврат "OTHER";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПричинаВыводаИзОборота(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныВыводаИзОборота.РозничнаяПродажа Тогда
		Возврат "RETAIL";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ЭкспортЕАЭС Тогда
		Возврат "EAS_TRADE";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Экспорт Тогда
		Возврат "BEYOND_EEC_EXPORT";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Возврат Тогда
		Возврат "RETURN";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ДистанционнаяПродажа Тогда
		Возврат "DISTANCE";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.УтратаПовреждение Тогда
		Возврат "LOSS";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Уничтожение Тогда
		Возврат "DESTRUCTION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Конфискация Тогда
		Возврат "CONFISCATION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Ликвидация Тогда
		Возврат "LIQUIDATION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ДляСобственныхНужд Тогда
		Возврат "OWN_USE";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.БезвозмезднаяПередача Тогда
		Возврат "DONATION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ПродажаПоГосКонтракту Тогда
		Возврат "STATE_CONTRACT";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ПродажаПоОбразцам Тогда
		Возврат "BY_SAMPLES";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ПродажаПоСделкеСГосТайной Тогда
		Возврат "STATE_SECRET";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Утилизация Тогда
		Возврат "UTILIZATION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Другое Тогда
		Возврат "OTHER";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определена причина вывода из оборота. Операция отменена.");
	#КонецЕсли
	
	Возврат "";
	
КонецФункции

Функция ПричинаСписанияКодаМаркировки(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныСписанияКодовМаркировки.Испорчен Тогда
		Возврат "KM_SPOILED";
	ИначеЕсли Причина = Перечисления.ПричиныСписанияКодовМаркировки.Уничтожен Тогда
		Возврат "KM_DESTROYED";
	ИначеЕсли Причина = Перечисления.ПричиныСписанияКодовМаркировки.Утерян Тогда
		Возврат "KM_LOST";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определена причина списания кода маркировки. Операция отменена.");
	#КонецЕсли
	
	Возврат "";
	
КонецФункции

Функция ВидВозвратаВОборот(ВидВозврата) Экспорт
	
	Если ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации Тогда
		Возврат "RETAIL_RETURN";
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриДистанционномСпособе Тогда
		Возврат "REMOTE_SALE_RETURN";
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ЧекВозврата Тогда
		Возврат "RECEIPT_RETURN";
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ВозвратТовараИзОборотаДляСобственныхНужд Тогда
		Возврат "OWN_USE_RETURN";
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПокупателяНеСвязанныхСПоследующейРеализацией Тогда
		Возврат "NOT_FOR_SALE_RETURN";
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Не определен вид возврата в оборот кода маркировки. Операция отменена.");
	#КонецЕсли
	
	Возврат "";
	
КонецФункции

Функция ВидТоварооборота(ВидОтгрузкиТоваров) Экспорт
	
	Если ВидОтгрузкиТоваров = Перечисления.ВидыОтгрузкиТоваров.Продажа Тогда
		Возврат "Продажа";
	ИначеЕсли ВидОтгрузкиТоваров = Перечисления.ВидыОтгрузкиТоваров.Комиссия Тогда
		Возврат "Комиссия";
	ИначеЕсли ВидОтгрузкиТоваров = Перечисления.ВидыОтгрузкиТоваров.Агент Тогда
		Возврат "Агент";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПричинаОтгрузкиТовара(ПричинаВыводаИзОборота) Экспорт
	
	Если ПричинаВыводаИзОборота = Перечисления.ПричиныОтгрузкиТоваров.БезВозмезднаяПередача Тогда
		Возврат "Безвозмездная передача";
	ИначеЕсли ПричинаВыводаИзОборота = Перечисления.ПричиныОтгрузкиТоваров.ПриобретениеГосПредприятием Тогда
		Возврат "Приобретение гос.предприятием";
	ИначеЕсли ПричинаВыводаИзОборота = Перечисления.ПричиныОтгрузкиТоваров.ИспользованиеДляСобственныхНуждПокупателем Тогда
		Возврат "Использование для собственных нужд покупателем";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Определяет, что переданная товарная группа принадлежит "Молочная продукция"
//
// Параметры:
//  ТоварнаяГруппа	 - Строка - Имя товарной группы
// 
// Возвращаемое значение:
//  Булево - Признак принадлежности к товарной группе "Молочная продукция"
//
Функция ЭтоТоварнаяГруппаМолочнаяПродукция(ТоварнаяГруппа) Экспорт
	
	Возврат НРег(ТоварнаяГруппа) = "milk";
	
КонецФункции // ЭтоТоварнаяГруппаМолочнаяПродукция()

Функция ПроверкаКодовМаркировкиВРазрешительномРежиме(ПараметрыПроверки) Экспорт
	
	РезультатПроверки = Новый Структура();
	РезультатПроверки.Вставить("КодыМаркировки", Неопределено);
	РезультатПроверки.Вставить("ТекстОшибки", "");
	
	// Получим по организации параметры подключения.
	ДанныеКонтура = ПараметрыПодключенияКЧестномуЗнаку(ПараметрыПроверки.Организация);
	
	Если Не ЗначениеЗаполнено(ДанныеКонтура.ТокенДляККТ) Тогда
		РезультатПроверки.ТекстОшибки = "Для проверки в разрешительном режиме необходимо для организации заполнить право №10029
			|""Токен для проверки кодов маркировки в разрешительном режиме"".";
		Возврат РезультатПроверки;
	КонецЕсли;
	
	// Актуализация CDN-площадок.
	CDNПлощадки = АктуальныйСписокCDNПлощадок(ДанныеКонтура);
	Если Не ПустаяСтрока(CDNПлощадки.ТекстОшибки) Тогда
		// Помещаем результат во временное хранилище
		РезультатПроверки.ТекстОшибки = CDNПлощадки.ТекстОшибки;
		Возврат РезультатПроверки;
	КонецЕсли;
	
	// Закэшируем список площадок в базе.
	Если CDNПлощадки.СписокCDNПлощадок.Количество() > 0 Тогда
		РезультатОбновления = ЗаписатьВРегистрCDNПлощадок(CDNПлощадки.СписокCDNПлощадок);
		Если ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки) Тогда
			// Помещаем результат во временное хранилище
			РезультатПроверки.ТекстОшибки = РезультатОбновления.ТекстОшибки;
			Возврат РезультатПроверки;
		КонецЕсли;
	КонецЕсли;
	
	// Выполним проверку кодов маркировки.
	РезультатПроверки = ПроверитьКодыМаркировки(ПараметрыПроверки, ДанныеКонтура);
	
	Возврат РезультатПроверки;
	
КонецФункции // ПроверкаКодовМаркировкиВРазрешительномРежиме()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыПодключенияКЧестномуЗнаку(Организация)
	
	ПараметрыЗапроса = Новый Структура();
	ТестовыйКонтур = обПолучитьПраваИНастройкиПользователя(Организация, "ТестовыйКонтурЧестногоЗнака");
	ТокенДляККТ = обПолучитьПраваИНастройкиПользователя(Организация, "ТокенДляККТ");
	
	Если ТестовыйКонтур Тогда
		ПараметрыЗапроса.Вставить("АдресКонтура", "markirovka.sandbox.crptech.ru");
		ПараметрыЗапроса.Вставить("Порт", 443);
		ПараметрыЗапроса.Вставить("АдресCDNПлощадок", "markirovka.sandbox.crptech.ru");
		ПараметрыЗапроса.Вставить("ЗащищенноеСоединение", Истина);
		ПараметрыЗапроса.Вставить("ВремяОжидания", 60);
	Иначе
		ПараметрыЗапроса.Вставить("АдресКонтура", "ismp.crpt.ru");
		ПараметрыЗапроса.Вставить("Порт", 443);
		ПараметрыЗапроса.Вставить("АдресCDNПлощадок", "cdn.crpt.ru");
		ПараметрыЗапроса.Вставить("ЗащищенноеСоединение", Истина);
		ПараметрыЗапроса.Вставить("ВремяОжидания", 60);
	КонецЕсли;
	ПараметрыЗапроса.Вставить("ТокенДляККТ", ТокенДляККТ);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция АктуальныйСписокCDNПлощадок(
		Знач ПараметрыЗапроса,
		ПроверятьДатуОбновленияПлощадок = Истина)
	
	ДатаПроверкиСпискаCDNПлощадок = ТекущаяУниверсальнаяДата();
	РезультатАктуализации = Новый Структура();
	РезультатАктуализации.Вставить("СписокCDNПлощадок", Новый Соответствие());
	РезультатАктуализации.Вставить("ТекстОшибки", "");
	РезультатАктуализации.Вставить("КодОшибки", "");
	РезультатАктуализации.Вставить("ДатаОбновленияCDNПлощадок", ДатаПроверкиСпискаCDNПлощадок);
	
	ДатаПоследнегоПолученияПлощадки = ПоследнееОбновлениеCDNПлощадки();
	ШестьЧасов = 3456;
	
	// Если дата последней загрузки площадки менее шести часов, то обновления не требуется.
	Если ПроверятьДатуОбновленияПлощадок
		И ДатаПоследнегоПолученияПлощадки <> Дата(1, 1, 1)
		И ДатаПоследнегоПолученияПлощадки + ШестьЧасов > ДатаПроверкиСпискаCDNПлощадок Тогда
		Возврат РезультатАктуализации;
	КонецЕсли;
	
	ПараметрыЗапроса.АдресКонтура = ПараметрыЗапроса.АдресCDNПлощадок;
	
	// Сформируем запрос обновления CDN-площадки
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("X-API-KEY", ПараметрыЗапроса.ТокенДляККТ);
	
	URLЗапроса = "api/v4/true-api/cdn/info";
	
	РезультатЗапроса = ОтправитьЗапросВСервис(
		URLЗапроса,
		Неопределено,
		ПараметрыЗапроса,
		"GET",
		ПараметрыЗапроса.ТокенДляККТ,
		ЗаголовокHTTP);
	
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.КодСостояния = 200 Тогда
		
		ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета, Истина);
		
		Если ДанныеОбработки = Неопределено Тогда
			
			Возврат "";
			
		Иначе
			
			СписокCDNПлощадок = ДанныеОбработки.Получить("hosts");
			
			
			// Обновим информацию о площадках.
			Для Каждого CDNПлощадка Из СписокCDNПлощадок Цикл
				
				АдресCDNПлощадки = CDNПлощадка.Получить("host");
				ПолучитьСостояниеCDNПлощадки(
					АдресCDNПлощадки,
					ПараметрыЗапроса.ТокенДляККТ,
					РезультатАктуализации,
					ПараметрыЗапроса,
					ЗаголовокHTTP);
				
				// Необходимо обновить токен
				Если РезультатАктуализации.КодОшибки = 401 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	Иначе
		
		ЗаписьЖурналаРегистрации(
			"Ошибка в результате актуализации CDN-площадки",
			УровеньЖурналаРегистрации.Ошибка,
			, ,
			"Ошибка в результате актуализации CDN-площадки:"
				+ Символы.ПС
				+ ?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)
		);
			
		РезультатАктуализации.Вставить("ТекстОшибки",
			"Ошибка в результате актуализации CDN-площадки: подробности в Журнале регистрации");
		
	КонецЕсли;
	
	Возврат РезультатАктуализации;
	
КонецФункции // АктуализироватьCDNПлощадки()

Функция ПоследнееОбновлениеCDNПлощадки()
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CDNПлощадки.ДатаАктуализации КАК ДатаАктуализации
	|ИЗ
	|	РегистрСведений.CDNПлощадки КАК CDNПлощадки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаАктуализации УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ДатаАктуализации;
	
КонецФункции

Функция ОтправитьЗапросВСервис(
		АдресСервера,
		ДанныеЗапроса,
		ПараметрыЗапроса,
		МетодЗапроса,
		КлючСессии,
		Заголовок = Неопределено)
	
	Результат = Новый Структура("Ответ,ТекстОшибки", Неопределено, "");
	
	Если ТипЗнч(ДанныеЗапроса) = Тип("Строка") Тогда
		ТелоЗапроса = ДанныеЗапроса;
	ИначеЕсли ДанныеЗапроса <> Неопределено Тогда
		ТелоЗапроса = ДанныеВТекстJSON(ДанныеЗапроса, Истина);
	КонецЕсли;
	
	Если ПараметрыЗапроса.ЗащищенноеСоединение Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	Иначе
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Если Заголовок = Неопределено Тогда
		Заголовок = Новый Соответствие();
		Заголовок.Вставить("Content-Type",   "application/json; charset=utf-8");
		Заголовок.Вставить("Accept-Charset", "utf-8");
		Если КлючСессии <> Неопределено Тогда
			Заголовок.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
		КонецЕсли;
	КонецЕсли;
	
	Запрос  = Новый HTTPЗапрос(АдресСервера, Заголовок);
	Если ДанныеЗапроса <> Неопределено Тогда
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
			ПараметрыЗапроса.АдресКонтура,
			ПараметрыЗапроса.Порт,,,,
			ПараметрыЗапроса.ВремяОжидания,
			ЗащищенноеСоединение);
		
		Если МетодЗапроса = "POST" Тогда
			Результат.Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		Иначе
			Результат.Ответ = Соединение.ВызватьHTTPМетод(МетодЗапроса, Запрос);
		КонецЕсли;
		
	Исключение
		
		Результат.ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(
			"Обмен с личным кабинетом Честного знака",
			УровеньЖурналаРегистрации.Ошибка,,,
			СтрШаблон(
				"Ошибка исполнения POST запроса %1: ",
				АдресСервера) + Символы.ПС
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеВТекстJSON(Структура, БезПробеловИПереносов = Ложь) Экспорт 
	
	Если БезПробеловИПереносов Тогда
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");
	Иначе
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	Возврат ТекстJSON;
	
КонецФункции

Функция ПреобразованиеОтправкаJSON(ПараметрыЗапроса)
	
	Результат = Новый Структура("СообщениеОтвета,КодСостояния,ТекстОшибки", Неопределено, 0, "");
	
	Если ПараметрыЗапроса <> Неопределено
		И ПараметрыЗапроса.Ответ <> Неопределено Тогда
		
		КодСостояния = ПараметрыЗапроса.Ответ.КодСостояния;
		ОтветТекст = ПараметрыЗапроса.Ответ.ПолучитьТелоКакСтроку();
		
		Если ЗначениеЗаполнено(ОтветТекст) Тогда
			
			ЧтениеОтвета = Новый ЧтениеJSON;
			ЧтениеОтвета.УстановитьСтроку(ОтветТекст);
			
			Попытка
				Объект = ПрочитатьJSON(ЧтениеОтвета, Ложь);
			Исключение
				Попытка
					Объект = ПрочитатьJSON(ЧтениеОтвета, Истина);
				Исключение
					Объект = Неопределено;
				КонецПопытки;
			КонецПопытки;
			
			Если Объект = Неопределено Тогда
				Результат.СообщениеОтвета = ОтветТекст;
			Иначе
				ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
				ЗаписатьJSON(ЗаписьJSON, Объект);
				Результат.СообщениеОтвета = ЗаписьJSON.Закрыть();
			КонецЕсли;
			
			Результат.КодСостояния  = КодСостояния;
			
		ИначеЕсли ЗначениеЗаполнено(КодСостояния) Тогда
			Результат.ТекстОшибки = СтрШаблон(НСтр("ru = 'Код состояния запроса HTTP: %1'"), КодСостояния);
		Иначе
			Результат.ТекстОшибки = НСтр("ru = 'Не отправлен запрос HTTP'");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирование из текста JSON структуру.
// 
// Параметры:
//  ТекстJSON - Строка - Текст JSON
//	ПрочитатьВСоответствие - Булево - Чтение объекта JSON в соответствие или структуру.
// 
// Возвращаемое значение:
//  Структура - Текст JSON
// 
Функция ТекстJSONВОбъект(ТекстJSON, ПрочитатьВСоответствие = Ложь) Экспорт 
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Попытка
		РезультатРазбора = ПрочитатьJSON(Чтение, ПрочитатьВСоответствие);
	Исключение
		РезультатРазбора = Неопределено;
	КонецПопытки;
	Возврат РезультатРазбора;
	
КонецФункции

Процедура ПолучитьСостояниеCDNПлощадки(
		АдресCDNПлощадки,
		ТокенДляККТ,
		РезультатАктуализации,
		Знач ПараметрыЗапроса,
		ЗаголовокHTTP)
	
	ПараметрыЗапросаCDNПлощадки = ЧастиАдресаCDNПлощадки(АдресCDNПлощадки);
	ПараметрыЗапроса.АдресКонтура = ПараметрыЗапросаCDNПлощадки.Адрес;
	ПараметрыЗапроса.Порт = ПараметрыЗапросаCDNПлощадки.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыЗапросаCDNПлощадки.ЗащищенноеСоединение;
	
	URLЗапроса    = "api/v4/true-api/cdn/health/check";
	НачалоОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	РезультатЗапроса = ОтправитьЗапросВСервис(
		URLЗапроса,
		Неопределено,
		ПараметрыЗапроса,
		"GET",
		ТокенДляККТ,
		ЗаголовокHTTP);
	
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.КодСостояния = 200 Тогда
		
		ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета, Истина);
		ВремяПроверки = 0;
		
		Если ДанныеОбработки.Получить("avgTimeMs") <> Неопределено Тогда
			ВремяПроверки = ДанныеОбработки.Получить("avgTimeMs");
		КонецЕсли;
		
		СостояниеПлощадки = Новый Структура();
		СостояниеПлощадки.Вставить("ВремяВыполненияОперации", ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоОперации);
		СостояниеПлощадки.Вставить("ВремяПроверки", ВремяПроверки);
		СостояниеПлощадки.Вставить("ДатаОбновленияCDNПлощадок", РезультатАктуализации.ДатаОбновленияCDNПлощадок);
		
		Если РезультатАктуализации.Свойство("СписокCDNПлощадок") Тогда
			РезультатАктуализации.СписокCDNПлощадок.Вставить(АдресCDNПлощадки, СостояниеПлощадки);
		Иначе
			Если Не РезультатАктуализации.Свойство("ВремяВыполненияОперации") Тогда
				РезультатАктуализации.Вставить("ВремяВыполненияОперации", СостояниеПлощадки.ВремяВыполненияОперации);
			КонецЕсли;
			Если Не РезультатАктуализации.Свойство("ВремяПроверки") Тогда
				РезультатАктуализации.Вставить("ВремяПроверки", СостояниеПлощадки.ВремяПроверки);
			КонецЕсли;
			Если Не РезультатАктуализации.Свойство("ДатаОбновленияCDNПлощадок") Тогда
				РезультатАктуализации.Вставить("ДатаОбновленияCDNПлощадок", СостояниеПлощадки.ДатаОбновленияCDNПлощадок);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли РезультатОтправки.КодСостояния = 429
		ИЛИ (РезультатОтправки.КодСостояния >= 500 И РезультатОтправки.КодСостояния < 600) Тогда
		
		Если РезультатАктуализации.Свойство("КодОшибки") И РезультатАктуализации.КодОшибки <> 0 Тогда
			
			ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета, Истина);
			
			КодСостояния = 0;
			Если ДанныеОбработки.Получить("code") <> Неопределено Тогда
				КодСостояния = ДанныеОбработки.Получить("code");
			КонецЕсли;
			
			// Данная площадка повторно проверена, но еще не доступна.
			// Устанавливаем недостуность площадки на 15 минут.
			ПятнадцатьМинут = 900;
			СостояниеПлощадки = Новый Структура();
			СостояниеПлощадки.Вставить("ПропуститьПроверкуCDNПлощадок", КодСостояния = 5000);
			СостояниеПлощадки.Вставить("ВремяВыполненияОперации", ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоОперации);
			СостояниеПлощадки.Вставить("ВремяПроверки", 0);
			СостояниеПлощадки.Вставить("ДатаОбновленияCDNПлощадок", РезультатАктуализации.ДатаОбновленияCDNПлощадок);
			СостояниеПлощадки.Вставить("ДатаНедоступностиДо", ТекущаяУниверсальнаяДата() + ПятнадцатьМинут);
			Если РезультатАктуализации.Свойство("СписокCDNПлощадок") Тогда
				РезультатАктуализации.СписокCDNПлощадок.Вставить(АдресCDNПлощадки, СостояниеПлощадки);
			Иначе
				Для Каждого ПараметрПллощадки Из СостояниеПлощадки Цикл
					РезультатАктуализации.Вставить(ПараметрПллощадки.Ключ, ПараметрПллощадки.Значение);
				КонецЦикла;
			КонецЕсли;
			Возврат;
			
		КонецЕсли;
		
		РезультатАктуализации.Вставить("КодОшибки", РезультатОтправки.КодСостояния);
		
	// Повторяем запрос
		ПолучитьСостояниеCDNПлощадки(
			АдресCDNПлощадки,
			ТокенДляККТ,
			РезультатАктуализации,
			ПараметрыЗапроса,
			ЗаголовокHTTP);
		
	Иначе
		
		ЗаписьЖурналаРегистрации(
			"Ошибка в результате получения состояния CDN-площадки",
			УровеньЖурналаРегистрации.Ошибка,
			, ,
			"Ошибка в результате получения состояния CDN-площадки:"
				+ Символы.ПС
				+ ?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)
		);
			
		РезультатАктуализации.Вставить("ТекстОшибки",
			"Ошибка в результате получения состояния CDN-площадки: подробности в Журнале регистрации");
		
		РезультатАктуализации.Вставить("КодОшибки", РезультатОтправки.КодСостояния);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЧастиАдресаCDNПлощадки(Адрес)
	
	Результат = Новый Структура("Адрес,Порт,ЗащищенноеСоединение");
	ЧастиАдреса = СтрРазделить(Адрес, "/", Ложь);
	
	Протокол = СокрЛП(ЧастиАдреса[0]) + "//";
	ЧастиАдреса.Удалить(0);
	
	ЧастиИмени = СтрРазделить(СокрЛП(ЧастиАдреса[0]), ":");
	ЧастиАдреса.Удалить(0);
	Результат.Адрес = ЧастиИмени[0];
	ПортСервера = ?(ЧастиИмени.Количество() = 1, "", СокрЛП(ЧастиИмени[1]));
	Результат.Порт = ?(ПустаяСтрока(ПортСервера), 443, Число(ПортСервера));
	Если Протокол = "http://" Тогда
		Результат.ЗащищенноеСоединение = Ложь;
	Иначе
		Результат.ЗащищенноеСоединение = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьВРегистрCDNПлощадок(СписокCDNПлощадок)
	
	РезультатВозврата = Новый Структура("ТекстОшибки", "");
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.CDNПлощадки");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
	
		НаборЗаписей = РегистрыСведений.CDNПлощадки.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		Для Каждого СтрокаСпискаПлощадок Из СписокCDNПлощадок Цикл
			
			ЗаписьРегистра = РегистрыСведений.CDNПлощадки.СоздатьМенеджерЗаписи();
			
			ЗаписьРегистра.Адрес = СтрокаСпискаПлощадок.Ключ;
			ЗаписьРегистра.ДатаАктуализации = СтрокаСпискаПлощадок.Значение.ДатаОбновленияCDNПлощадок;
			ЗаписьРегистра.ВремяОтвета = СтрокаСпискаПлощадок.Значение.ВремяВыполненияОперации;
			ЗаписьРегистра.ВремяПроверкиКодаМаркировки = СтрокаСпискаПлощадок.Значение.ВремяПроверки;
			
			Если СтрокаСпискаПлощадок.Значение.Свойство("ДатаНедоступностиДо") Тогда
				
				ЗаписьРегистра.ДатаНедоступностиДо = СтрокаСпискаПлощадок.Значение.ДатаНедоступностиДо;
				
			КонецЕсли;
			
			ЗаписьРегистра.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		РезультатВозврата.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатВозврата;
	
КонецФункции

Функция ПроверитьКодыМаркировки(ПараметрыПроверки, Знач ПараметрыЗапроса)
	
	Результат = Новый Структура();
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("КодыМаркировки", Новый Соответствие());
	
	// Сформируем запрос проверки.
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("X-API-KEY", ПараметрыЗапроса.ТокенДляККТ);
	
	ПолучениеАдресаCDNПлощадки = CDNПлощадкаДляПроверки(ПараметрыЗапроса, ПараметрыЗапроса.ТокенДляККТ, ЗаголовокHTTP);
	
	// Достуных площадок не найдено.
	Если ЗначениеЗаполнено(ПолучениеАдресаCDNПлощадки.ТекстОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, ПолучениеАдресаCDNПлощадки);
		Возврат Результат;
	ИначеЕсли ПустаяСтрока(ПолучениеАдресаCDNПлощадки.АдресCDNПлощадки) Тогда
		Результат.ТекстОшибки = "Сервис проверки кодов в разрешительном режиме недоступен.";
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыЗапросаCDNПлощадки = ЧастиАдресаCDNПлощадки(ПолучениеАдресаCDNПлощадки.АдресCDNПлощадки);
	ПараметрыЗапроса.АдресКонтура = ПараметрыЗапросаCDNПлощадки.Адрес;
	ПараметрыЗапроса.Порт = ПараметрыЗапросаCDNПлощадки.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = ПараметрыЗапросаCDNПлощадки.ЗащищенноеСоединение;
	
	ПолныеКодыМаркировки = ПолныеКодыМаркировки(ПараметрыПроверки.КодыМаркировки);
	ЭтоВозвратКодаМаркировки = ДокументВозвратаКодаМаркировки(ПараметрыПроверки);
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("codes", ПолныеКодыМаркировки);
	
	URLЗапроса = "api/v4/true-api/codes/check";
	
	РезультатЗапроса = ОтправитьЗапросВСервис(
		URLЗапроса,
		ТелоЗапроса,
		ПараметрыЗапроса,
		"POST",
		ПараметрыЗапроса.ТокенДляККТ,
		ЗаголовокHTTP);
	
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.Свойство("ОтветПолучен") И Не РезультатОтправки.ОтветПолучен Тогда
		
		Результат.Вставить("ТекстОшибки", 
			СтрШаблон("Ошибка в результате проверки кодов маркировки в разрешительном режиме: %1"),
			РезультатОтправки.СообщениеОтвета
		);
		Возврат Результат;
		
	КонецЕсли;
	
	Если РезультатОтправки.КодСостояния = 200 Тогда
		
		ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета, Истина);
		
		Если ДанныеОбработки = Неопределено Тогда
			
			Результат.Вставить("ТекстОшибки", 
				СтрШаблон("Ошибка в результате проверки кодов маркировки в разрешительном режиме: %1",
				РезультатОтправки.СообщениеОтвета)
			);
			
		Иначе
			
			ОбработкаШтрихКода = Обработки.ШтрихКоды.Создать();
			КодыОшибкиПриПроверкеКодаМаркировки = КодыОшибкиПриПроверкеКодаМаркировки();
			ДанныеПоКодамМаркировки = ДанныеОбработки.Получить("codes");
			Для Каждого ЭлементДанных Из ДанныеПоКодамМаркировки Цикл
				
				КодОшибки = ЭлементДанных["errorCode"];
				СообщениеОбОшибке = ЭлементДанных["message"];
				ТекстОшибки = "";
				
				Если ЗначениеЗаполнено(КодОшибки) Тогда
					
					ОписаниеОшибки = КодыОшибкиПриПроверкеКодаМаркировки.Получить(КодОшибки);
					
					Если ОписаниеОшибки = Неопределено Тогда
						
						ТекстОшибки = СтрШаблон("Возникала ошибка при проверке кода маркирвоки в разрешительном режиме.
							|Описание из сервиса: %1.",
							?(СообщениеОбОшибке = Неопределено, "ошибка не указана", СообщениеОбОшибке));
						
					Иначе
						
						ТекстОшибки = ОписаниеОшибки;
						
					КонецЕсли;
					
				Иначе
					
					Если ЭлементДанных["found"] = Ложь Тогда
						
						ТекстОшибки = "Код маркировки не найден в ГИС МТ.";
						
					ИначеЕсли ЭлементДанных["utilised"] = Ложь Тогда
						
						ТекстОшибки = "Код маркировки эмитирован, но нет информации о его нанесении.";
						
					ИначеЕсли ЭлементДанных["verified"] = Ложь Тогда
						
						ТекстОшибки = "Не пройдена криптографическая проверка кода маркировки.";
						
					ИначеЕсли Не ЭтоВозвратКодаМаркировки И ЭлементДанных["sold"] = Истина Тогда
						
						ТекстОшибки = "Код маркировки ранее был выведен из оборота.";
						
					ИначеЕсли ЭтоВозвратКодаМаркировки И ЭлементДанных["sold"] = Ложь Тогда
						
						ТекстОшибки = "Код маркировки ранее не был выведен из оборота.";
						
					ИначеЕсли ЭлементДанных["isBlocked"] = Истина
						И ЭлементДанных["ogvs"] <> Неопределено Тогда
						
						ТекстОшибки = СтрШаблон("Код маркировки заблокирован по решению %1", 
							ПредставлениеОргановГосударственнойВласти(ЭлементДанных["ogvs"]));
						
					ИначеЕсли Не ЭтоВозвратКодаМаркировки И ЭлементДанных["realizable"] = Ложь Тогда
						
						ТекстОшибки = "Нет информации о вводе в оборот.";
						
					ИначеЕсли ЭлементДанных["valid"] = Ложь Тогда
						
						ТекстОшибки = "Структура данных кода маркировки некорректна.";
						
					ИначеЕсли СообщениеОбОшибке <> Неопределено Тогда
						
						ШаблонПодсказки   = "Возникала ошибка при проверке кода маркирвоки в разрешительном режиме.
						|Описание из сервиса: %1.";
						
						ТекстОшибки = СтрШаблон(ШаблонПодсказки, СообщениеОбОшибке);
						
					КонецЕсли;
					
				КонецЕсли;
				
				ДатаЗапроса = Формат(ДанныеОбработки.Получить("reqTimestamp"), "ЧГ=0");
				ИдентификаторЗапроса = ДанныеОбработки.Получить("reqId");
				ЗначениеОтраслевогоРеквизита = СтрШаблон("UUID=%1&Time=%2", ИдентификаторЗапроса, ДатаЗапроса);
				
				СтруктураМаркировки = ОбработкаШтрихКода.РазобратьСтрокуШтрихкодаGS1(ЭлементДанных["printView"], Истина);
				
				Если НЕ СтруктураМаркировки.Разобран Тогда
					Продолжить;
				КонецЕсли;
				Идентификатор01 = СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
				Идентификатор21 = СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
				КодМаркировки = СтрШаблон("(01)%1(21)%2", Идентификатор01, Идентификатор21);
				
				ОписаниеРезультатаПроверки = Новый Структура();
				ОписаниеРезультатаПроверки.Вставить("ЗначениеОтраслевогоРеквизита", ЗначениеОтраслевогоРеквизита);
				ОписаниеРезультатаПроверки.Вставить("ТекстОшибки", ТекстОшибки);
				
				Результат.КодыМаркировки.Вставить(КодМаркировки, ОписаниеРезультатаПроверки);
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьЖурналаРегистрации(
			"Ошибка в результате проверки кодов маркировки в разрешительном режиме",
			УровеньЖурналаРегистрации.Ошибка,
			, ,
			"Ошибка в результате проверки кодов маркировки в разрешительном режиме:"
				+ Символы.ПС
				+ ?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)
		);
		
		Результат.Вставить("ТекстОшибки",
			"Ошибка в результате проверки кодов маркировки в разрешительном режиме: подробности в Журнале регистрации");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СписокДоступныхCNDПлощадок()
	
	// Получим доступные площадки.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CDNПлощадки.ДатаАктуализации КАК ДатаАктуализации
	|ПОМЕСТИТЬ МаксимальнаяДатаОбновления
	|ИЗ
	|	РегистрСведений.CDNПлощадки КАК CDNПлощадки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаАктуализации УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CDNПлощадки.Адрес КАК Адрес,
	|	CDNПлощадки.ДатаНедоступностиДо КАК ДатаНедоступностиДо,
	|	CDNПлощадки.ДатаАктуализации КАК ДатаАктуализации,
	|	CDNПлощадки.ВремяПроверкиКодаМаркировки + CDNПлощадки.ВремяОтвета КАК Приоритет
	|ИЗ
	|	МаксимальнаяДатаОбновления КАК МаксимальнаяДатаОбновления,
	|	РегистрСведений.CDNПлощадки КАК CDNПлощадки
	|ГДЕ
	|	CDNПлощадки.ДатаАктуализации В
	|			(ВЫБРАТЬ
	|				МаксимальнаяДатаОбновления.ДатаАктуализации КАК ДатаАктуализации
	|			ИЗ
	|				МаксимальнаяДатаОбновления КАК МаксимальнаяДатаОбновления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНедоступностиДо,
	|	Приоритет";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция CDNПлощадкаДляПроверки(ПараметрыЗапроса, КлючСессии, ЗаголовокHTTP)
	
	Результат = Новый Структура();
	Результат.Вставить("АдресCDNПлощадки", "");
	Результат.Вставить("ТекстОшибки", "");
	
	// Получим список доступных CND-площадок.
	ДоступныеCNDПлощадки = СписокДоступныхCNDПлощадок();
	
	Если ДоступныеCNDПлощадки.Количество() = 0 Тогда
		
		// Попробуем еще раз обновить площадки.
		CDNПлощадки = АктуальныйСписокCDNПлощадок(
			ПараметрыЗапроса,
			Ложь);
		
		Если Не ПустаяСтрока(CDNПлощадки.ТекстОшибки) Тогда
			
			// Ошибка при получении площадок.
			Результат.ТекстОшибки = CDNПлощадки.ТекстОшибки;
			Возврат Результат;
			
		КонецЕсли;
		
		// Закэшируем список площадок в базе.
		Если CDNПлощадки.СписокCDNПлощадок.Количество() > 0 Тогда
			
			РезультатОбновления = ЗаписатьВРегистрCDNПлощадок(CDNПлощадки.СписокCDNПлощадок);
			
			Если ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки) Тогда
				
				// Помещаем результат во временное хранилище
				Результат.ТекстОшибки = РезультатОбновления.ТекстОшибки;
				Возврат Результат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДоступныеCNDПлощадки = СписокДоступныхCNDПлощадок();
		
		Если ДоступныеCNDПлощадки.Количество() = 0 Тогда
			
			Результат.ТекстОшибки =
				"Нет доступных CDN-площадок для проверки кодов маркировки в разрешительном режиме";
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Берем первую площадку по приоритету и получаем ее состояние
	Для Каждого Площадка Из ДоступныеCNDПлощадки Цикл
		
		РезультатАктуализации = Новый Структура();
		РезультатАктуализации.Вставить("ДатаОбновленияCDNПлощадок", Площадка.ДатаАктуализации);
		ПолучитьСостояниеCDNПлощадки(
			Площадка.Адрес,
			КлючСессии,
			РезультатАктуализации,
			ПараметрыЗапроса,
			ЗаголовокHTTP);
		
		Если РезультатАктуализации.Свойство("ПропуститьПроверкуCDNПлощадок")
			И РезультатАктуализации.ПропуститьПроверкуCDNПлощадок = Истина Тогда
			
			Результат.ТекстОшибки =
				"Сервис трансграничной проверки кодов недоступен. Чек можно пробить без проверки в режиме онлайн.";
			Возврат Результат;
			
		КонецЕсли;
		
		// Площадка еще не доступна. Зафисируем время ее недостуности и перейдем к выбору другой.
		Если РезультатАктуализации.Свойство("ДатаНедоступностиДо")
			И ЗначениеЗаполнено(РезультатАктуализации.ДатаНедоступностиДо) Тогда
			
			СписокCDNПлощадок = Новый Соответствие;
			СписокCDNПлощадок.Вставить(Площадка.Адрес, РезультатАктуализации);
			ЗаписатьВРегистрCDNПлощадок(СписокCDNПлощадок);
			Продолжить;
			
		КонецЕсли;
		
		// Получили доступную площадку.
		Результат.АдресCDNПлощадки = Площадка.Адрес;
		Прервать;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолныеКодыМаркировки(КодыМаркировки)
	
	Результат = Новый Массив();
	
	Для Каждого КодМаркировки Из КодыМаркировки Цикл
		ДвоичныеДанные = Base64Значение(КодМаркировки);
		Если ДвоичныеДанные = Неопределено Тогда
			Штрихкод = КодМаркировки;
		Иначе
			Штрихкод = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
		КонецЕсли;
		Результат.Добавить(Штрихкод);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДокументВозвратаКодаМаркировки(ПараметрыДокумента)
	
	Если Не ЗначениеЗаполнено(ПараметрыДокумента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ХозОперация = Неопределено;
	ДокументОснование = Неопределено;
	ПараметрыДокумента.Свойство("ХозОперация", ХозОперация);
	ПараметрыДокумента.Свойство("ДокументОснование", ДокументОснование);
	
	ОперацииВозврата = Новый Массив;
	ОперацииВозврата.Добавить(Справочники.ХозОперации.ЧекНаВозврат);
	ОперацииВозврата.Добавить(Справочники.ХозОперации.ЧекНаОплатуВозврат);
	
	Если ХозОперация = Справочники.ХозОперации.ЧекКоррекции Тогда
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			ХозОперация = ДокументОснование.ХозОперация;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОперацииВозврата.Найти(ХозОперация) <> Неопределено;
	
КонецФункции

Функция КодыОшибкиПриПроверкеКодаМаркировки()
	
	ОписаниеОшибкиПоКоду = Новый Соответствие();
	ОписаниеОшибкиПоКоду.Вставить(0, "Ошибки отсутствуют.");
	ОписаниеОшибкиПоКоду.Вставить(1, "Ошибка валидации кода маркировки.");
	ОписаниеОшибкиПоКоду.Вставить(2, "Код маркировки не содержит GTIN.");
	ОписаниеОшибкиПоКоду.Вставить(3, "Код маркировки не содержит серийный номер.");
	ОписаниеОшибкиПоКоду.Вставить(4, "Код маркировки содержит недопустимые символы.");
	ОписаниеОшибкиПоКоду.Вставить(5, 
		"Ошибка верификации крипто-подписи кода маркировки (формат крипто-подписи не соответствует типу).");
	ОписаниеОшибкиПоКоду.Вставить(6,
		"Ошибка верификации крипто-подписи кода маркировки (крипто-подпись не валидная).");
	ОписаниеОшибкиПоКоду.Вставить(7,
		"Ошибка верификации крипто-подписи кода маркировки (крипто-ключ не валиден).");
	ОписаниеОшибкиПоКоду.Вставить(8, "Код маркировки не прошел верификацию в стране эмитента.");
	ОписаниеОшибкиПоКоду.Вставить(9, "Найденные AI в коде маркировки не поддерживаются.");
	ОписаниеОшибкиПоКоду.Вставить(10, "Код маркировки не найден в ГИС МТ.");
	ОписаниеОшибкиПоКоду.Вставить(11, "Код маркировки не найден в трансгране.");
	
	Возврат ОписаниеОшибкиПоКоду;
	
КонецФункции

Функция ПредставлениеОргановГосударственнойВласти(ИдентификаторыОргановГосударственнойВласти)
	
	ПредставленияОргановГосударственнойВласти = Новый Соответствие();
	ПредставленияОргановГосударственнойВласти.Вставить("RAR",  НСтр("ru = 'Росалкогольрегулирование'"));
	ПредставленияОргановГосударственнойВласти.Вставить("FTS",  НСтр("ru = 'ФТС России'"));
	ПредставленияОргановГосударственнойВласти.Вставить("FNS",  НСтр("ru = 'ФНС России'"));
	ПредставленияОргановГосударственнойВласти.Вставить("RSHN", НСтр("ru = 'Россельхознадзор (РСХН)'"));
	ПредставленияОргановГосударственнойВласти.Вставить("RPN",  НСтр("ru = 'Роспотребнадзор (РПН)'"));
	ПредставленияОргановГосударственнойВласти.Вставить("MVD",  НСтр("ru = 'МВД России'"));
	ПредставленияОргановГосударственнойВласти.Вставить("RZN",  НСтр("ru = 'Росздравнадзор'"));
	
	ПредствленияИдентификаторов = Новый Массив;
	
	Для Каждого Идентификатор Из ИдентификаторыОргановГосударственнойВласти Цикл
		
		Представление = ПредставленияОргановГосударственнойВласти.Получить(Идентификатор);
		
		Если Представление = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПредствленияИдентификаторов.Добавить(Представление);
		
	КонецЦикла;
	
	Возврат СтрСоединить(ПредствленияИдентификаторов, ", ");
	
КонецФункции

#КонецОбласти
